; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_31)

(:domain logistics)

(:objects
	obj0 obj2 - airport
	obj1 obj3 - city
	obj4 obj5 obj16 - location
	obj6 obj7 obj9 - truck
	obj8 obj10 obj11 obj12 obj13 - package
	obj14 obj15 - airplane
)

(:init
	(at obj6 obj0)
	(at obj7 obj2)
	(at obj8 obj0)
	(at obj9 obj2)
	(at obj10 obj2)
	(at obj11 obj2)
	(at obj12 obj0)
	(at obj13 obj2)
	(at obj14 obj0)
	(at obj15 obj2)
	(in-city obj0 obj1)
	(in-city obj2 obj3)
	(in-city obj4 obj1)
	(in-city obj5 obj3)
	(in-city obj16 obj3)
)

(:goal (and
	(at obj8 obj16)
	(at obj10 obj4)
	(at obj11 obj4)
	(at obj12 obj5)
	(at obj13 obj4)
))
)

; plan
1. (drive obj6 obj0 obj4)
   deleted: (at obj6 obj0)
   added: (at obj6 obj4)
   goals met: 0 of 5
2. (drive obj7 obj2 obj5)
   deleted: (at obj7 obj2)
   added: (at obj7 obj5)
   goals met: 0 of 5
3. (drive obj9 obj2 obj5)
   deleted: (at obj9 obj2)
   added: (at obj9 obj5)
   goals met: 0 of 5
4. (fly obj15 obj2 obj0)
   deleted: (at obj15 obj2)
   added: (at obj15 obj0)
   goals met: 0 of 5
5. (load obj14 obj12 obj0)
   deleted: (at obj12 obj0)
   added: (in obj12 obj14)
   goals met: 0 of 5
6. (load obj14 obj8 obj0)
   deleted: (at obj8 obj0)
   added: (in obj8 obj14)
   goals met: 0 of 5
7. (fly obj14 obj0 obj2)
   deleted: (at obj14 obj0)
   added: (at obj14 obj2)
   goals met: 0 of 5
8. (drive obj6 obj4 obj0)
   deleted: (at obj6 obj4)
   added: (at obj6 obj0)
   goals met: 0 of 5
9. (drive obj7 obj5 obj2)
   deleted: (at obj7 obj5)
   added: (at obj7 obj2)
   goals met: 0 of 5
10. (drive obj9 obj5 obj2)
   deleted: (at obj9 obj5)
   added: (at obj9 obj2)
   goals met: 0 of 5
11. (fly obj15 obj0 obj2)
   deleted: (at obj15 obj0)
   added: (at obj15 obj2)
   goals met: 0 of 5
12. (load obj14 obj10 obj2)
   deleted: (at obj10 obj2)
   added: (in obj10 obj14)
   goals met: 0 of 5
13. (load obj14 obj11 obj2)
   deleted: (at obj11 obj2)
   added: (in obj11 obj14)
   goals met: 0 of 5
14. (load obj14 obj13 obj2)
   deleted: (at obj13 obj2)
   added: (in obj13 obj14)
   goals met: 0 of 5
15. (unload obj14 obj12 obj2)
   deleted: (in obj12 obj14)
   added: (at obj12 obj2)
   goals met: 0 of 5
16. (unload obj14 obj8 obj2)
   deleted: (in obj8 obj14)
   added: (at obj8 obj2)
   goals met: 0 of 5
17. (fly obj14 obj2 obj0)
   deleted: (at obj14 obj2)
   added: (at obj14 obj0)
   goals met: 0 of 5
18. (unload obj14 obj10 obj0)
   deleted: (in obj10 obj14)
   added: (at obj10 obj0)
   goals met: 0 of 5
19. (unload obj14 obj11 obj0)
   deleted: (in obj11 obj14)
   added: (at obj11 obj0)
   goals met: 0 of 5
20. (unload obj14 obj13 obj0)
   deleted: (in obj13 obj14)
   added: (at obj13 obj0)
   goals met: 0 of 5
21. (fly obj14 obj0 obj2)
   deleted: (at obj14 obj0)
   added: (at obj14 obj2)
   goals met: 0 of 5
22. (fly obj15 obj2 obj0)
   deleted: (at obj15 obj2)
   added: (at obj15 obj0)
   goals met: 0 of 5
23. (load obj6 obj10 obj0)
   deleted: (at obj10 obj0)
   added: (in obj10 obj6)
   goals met: 0 of 5
24. (load obj6 obj11 obj0)
   deleted: (at obj11 obj0)
   added: (in obj11 obj6)
   goals met: 0 of 5
25. (load obj6 obj13 obj0)
   deleted: (at obj13 obj0)
   added: (in obj13 obj6)
   goals met: 0 of 5
26. (load obj7 obj8 obj2)
   deleted: (at obj8 obj2)
   added: (in obj8 obj7)
   goals met: 0 of 5
27. (load obj9 obj12 obj2)
   deleted: (at obj12 obj2)
   added: (in obj12 obj9)
   goals met: 0 of 5
28. (drive obj6 obj0 obj4)
   deleted: (at obj6 obj0)
   added: (at obj6 obj4)
   goals met: 0 of 5
29. (drive obj7 obj2 obj16)
   deleted: (at obj7 obj2)
   added: (at obj7 obj16)
   goals met: 0 of 5
30. (drive obj9 obj2 obj5)
   deleted: (at obj9 obj2)
   added: (at obj9 obj5)
   goals met: 0 of 5
31. (unload obj6 obj10 obj4)
   deleted: (in obj10 obj6)
   added: (at obj10 obj4)
   goals met: 1 of 5
32. (unload obj6 obj11 obj4)
   deleted: (in obj11 obj6)
   added: (at obj11 obj4)
   goals met: 2 of 5
33. (unload obj6 obj13 obj4)
   deleted: (in obj13 obj6)
   added: (at obj13 obj4)
   goals met: 3 of 5
34. (unload obj7 obj8 obj16)
   deleted: (in obj8 obj7)
   added: (at obj8 obj16)
   goals met: 4 of 5
35. (unload obj9 obj12 obj5)
   deleted: (in obj12 obj9)
   added: (at obj12 obj5)
   goals met: 5 of 5
